{
  "heading": "The Design-Centric Architect",
  "subheading": "Bridging the gap between engineering and business ROI.",
  "bio": [
    "I have spent 7 years professionalizing my approach to software, including a deep 5-year focus on the React ecosystem and 2 years mastering Next.js. My background as a Graphic Designer and Content Writer gives me a rare 'multipotentialite' edge: I don't just write functional code, I deliver pixel-perfect products with user empathy.",
    "For the past 5 years, I have architected modular UI systems and high-scale applications for international clients. I am known for my ability to hit a stride quickly in ambiguous environments, turning evolving requirements into production-ready solutions.",
    "My engineering philosophy is rooted in performance and scalability. Whether I am leading a distributed team or optimizing a complex B2B dashboard, I ensure every technical decision supports long-term business growth and a 30% average boost in speed."
  ],
  "cvLink": "/resume.pdf",
  "showHighlights": true,
  "highlightsTitle": "Technical Focus",
  "highlights": [
    {
      "title": "React & Next.js Specialist",
      "description": "5 years of dedicated React experience, including 2 years of building server-side rendered apps with Next.js.",
      "icon": "code-2"
    },
    {
      "title": "Full Lifecycle Leadership",
      "description": "7 years in the industry has taught me to manage projects from initial discovery to final cloud deployment.",
      "icon": "command"
    },
    {
      "title": "Performance Optimization",
      "description": "Expert in Core Web Vitals, achieving a 30% average performance lift through advanced architectural patterns.",
      "icon": "trending-up"
    }
  ],
  "showImpact": true,
  "impact": [
    { "target": 5, "label": "Years Experience", "suffix": "+" },
    { "label": "Projects Delivered", "target": 10, "suffix": "+" },
    { "target": 30, "label": "Performance Lift", "suffix": "%" },
    { "target": 100, "label": "Success Rate", "suffix": "%" }
  ]
}
